Project/Toir/src/Catalogs/торо_ВариантыАнализаПоказателейKPI/торо_ВариантыАнализаПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВариантыАнализаПоказателейKPI</name>
  <owners>Catalog.торо_ПоказателиKPI</owners>
  <attributes>
    <name>ТипАнализа</name>
    <type>
      <types>EnumRef.торо_ТипыАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияДанных</name>
    <type>
      <types>EnumRef.торо_АгрегацияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбратьСортировку</name>
    <type>
      <types>EnumRef.торо_ВариантыСортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбираемыхЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьНормализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеДробнойЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтображенияПоУмолчанию</name>
    <type>
      <types>EnumRef.торо_ВариантыОтображенияВариантовАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>EnumRef.торо_ТипыДиаграммПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПоставляемойМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНулевыеЗначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЛегенду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЗначениеАнализаПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЗначениеАнализаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЗначениеАнализаСлужб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЗначениеАнализаТипов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НеВыбиратьРазличные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Enums/торо_ВариантыОтображенияВариантовАнализа/торо_ВариантыОтображенияВариантовАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыОтображенияВариантовАнализа</name>
  <enumValues>
    <name>Кратко</name>
  </enumValues>
  <enumValues>
    <name>Диаграмма</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВариантыСортировки/торо_ВариантыСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыСортировки</name>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>Лучшие</name>
  </enumValues>
  <enumValues>
    <name>Худшие</name>
  </enumValues>
  <enumValues>
    <name>ПоВозрастанию</name>
  </enumValues>
  <enumValues>
    <name>ПоУбыванию</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ТипыДиаграммПоказателей/торо_ТипыДиаграммПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыДиаграммПоказателей</name>
  <enumValues>
    <name>Гистограмма</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаГоризонтальная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаГоризонтальнаяОбъемная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаНормированная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаНормированнаяГоризонтальная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаНормированнаяГоризонтальнаяОбъемная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаНормированнаяОбъемная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаОбъемная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаСНакоплением</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаСНакоплениемГоризонтальная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаСНакоплениемГоризонтальнаяОбъемная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаСНакоплениемОбъемная</name>
  </enumValues>
  <enumValues>
    <name>График</name>
  </enumValues>
  <enumValues>
    <name>ГрафикПоШагам</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСНакоплением</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластями</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластямиИНакоплением</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластямиНормированный</name>
  </enumValues>
  <enumValues>
    <name>Измерительная</name>
  </enumValues>
  <enumValues>
    <name>Круговая</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ТипыАнализа/торо_ТипыАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыАнализа</name>
  <enumValues>
    <name>ДинамикаИзменения</name>
  </enumValues>
  <enumValues>
    <name>ПокомпонентноеСравнениеСтруктура</name>
  </enumValues>
  <enumValues>
    <name>ПокомпонентноеСравнениеДинамика</name>
  </enumValues>
  <enumValues>
    <name>СравнениеСПрошлымПериодом</name>
  </enumValues>
  <enumValues>
    <name>ИзмерениеТекущегоСостояния</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ВариантыАнализаПоказателейKPI/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВариантОтображенияПоУмолчанию <> Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипДиаграммы");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ВариантОтображенияПоУмолчанию <> Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
		ТипДиаграммы = Неопределено;
	КонецЕсли;
	
	Если ВыбратьСортировку <> Перечисления.торо_ВариантыСортировки.Лучшие
		И ВыбратьСортировку <> Перечисления.торо_ВариантыСортировки.Худшие Тогда
		КоличествоВыбираемыхЭлементов = 0;
	КонецЕсли;
	
	Если НЕ (ВариантОтображенияПоУмолчанию = Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма
		И НЕ ТипДиаграммы = Перечисления.торо_ТипыДиаграммПоказателей.Измерительная
		И НЕ ТипАнализа = Перечисления.торо_ТипыАнализа.ДинамикаИзменения
		И НЕ ТипДиаграммы.Пустая()) Тогда
		
		ОтображатьЛегенду = Ложь;
		
	КонецЕсли;
	
	Если НЕ (ВариантОтображенияПоУмолчанию = Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма
		И НЕ ТипДиаграммы = Перечисления.торо_ТипыДиаграммПоказателей.Измерительная
		И НЕ ТипДиаграммы.Пустая()) Тогда
		
		ОтображатьПодписи = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИДПоставляемойМодели = "";
	
КонецПроцедуры

#КонецОбласти
